index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hi, I'm Wiljam</title>
<meta name="generator" content="Org mode" />

<meta http-equiv="Cache-Control" content="no-cache, no-store, must-revalidate" />
<meta http-equiv="Pragma" content="no-cache" />
<meta http-equiv="Expires" content="-1" />
<link rel="stylesheet" href="/static/tokyo-night-dark.min.css" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
<link rel="stylesheet" href="/static/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Hi, I'm Wiljam</h1>
<p>
(not my real name).
I'm a student from Poland, interested in low level and embedded software design,
programming language design, theoretical computer science and competetive programming.
Currently I'm studying in the best school in my country.
Apart from that I'm an old-tech enthusiast.
</p>

<div id="outline-container-org6a2214c" class="outline-2">
<h2 id="org6a2214c">Links</h2>
<div class="outline-text-2" id="text-org6a2214c">
</div>
<div id="outline-container-org81ea62b" class="outline-3">
<h3 id="org81ea62b"><a href="posts.html">Blog Posts</a></h3>
</div>
<div id="outline-container-org0c2ec4b" class="outline-3">
<h3 id="org0c2ec4b">Articles</h3>
<div class="outline-text-3" id="text-org0c2ec4b">
<ul class="org-ul">
<li><a href="articles/nvim-config.html">Configuring Neovim for Competetive Programming</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
